/*
 *  @name  会员相关提示信息
 *  @Copyright feiniu                //版权声明
 *  @Designed and built by frontEnd  @joker.ye //制作人
 *  @date 2014-12-08           //制作时间
 *  @update 2014-12-08        //最后更新时间
 */
define(function(require, exports, module) {

    return {
        username: {
            '0': '账号已经存在',
            '-1': '用户名错误',
            '-2': '用户名必须为\'以字母或下划线开头的字符\'、邮箱或手机号码。',
            '-3': '用户名不可为空',
            '-4': '用户名格式不正确,请重新输入',
            '-5': '手机号格式输入错误',
            '-6': '请输入手机号',
            '-7': '请输入Email',
            '-8': '输入的Email格式不正确',
            '-9': '账号不存在',
            '-10': '您还未绑定邮箱或密码',
            '-11': '您未绑定手机或邮箱，请咨询客服'
        },
        password: {
            '-1': '密码格式不正确,请重新输入',
            '-2': '密码过于简单。密码必须为大小写字母、数字和特殊字符的其中三者的组合。',
            '-3': '密码不可为空',
            '-4': '密码不能为纯数字、纯英文、纯符号',
            '-5': '密码格式错误,请输6~16个英文字符加数字组合'
        },
        password_repeat: {
            '-1': '两次输入的密码不相同'
        },
        captcha: {
            '-1': '验证码不正确',
            '-3': '验证码不能为空',
            '-4': '验证码获取失败',
            '-5': '请接受服务条款'
        },
        register: {
            '-1': '注册成功',
            '-2': '注册失败'
        },
        SMS: {
            '-1': '发送成功',
            '-2': '发送失败'
        },
        forget: {
            '-1': '密码重置成功',
            '-2': '密码重置失败'
        },
        wrongmsg: {
            '-1': '输入信息不合法',
        },
    }
});
