/*
 *  @name  正则表达式
 *  @Copyright feiniu                //版权声明
 *  @Designed and built by frontEnd  @joker.ye //制作人
 *  @date 2014-12-08           //制作时间
 *  @update 2014-12-08        //最后更新时间
 */
define(function(require, exports, module) {
    return {
        //用户相关的正则验证
        user_VARS: {
            "email": /^[a-z0-9]([a-z0-9\\.]*[-_]{0,4}?[a-z0-9\\.]+)*@([a-z0-9]*[-_]?[a-z0-9]+)+([\.][\w_-]+){1,5}$/i, //edit by PJ //[\\.][a-z]{2,3}([\\.][a-z]{2})?,
            "phone": /^1\d{10}$/,
            "username": /^[_a-zA-Z][_0-9a-zA-Z-]{3,19}$/i,
            "password": /^(?:(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[^A-Za-z0-9])|(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])|(?=.*[A-Z])(?=.*[a-z])(?=.*[^A-Za-z0-9])|(?=.*[A-Z])(?=.*[0-9])(?=.*[^A-Za-z0-9])|(?=.*[a-z])(?=.*[0-9])(?=.*[^A-Za-z0-9])|(?=.*[A-Z])(?=.*[a-z])|(?=.*[A-Z])(?=.*[0-9])|(?=.*[A-Z])(?=.*[^A-Za-z0-9])|(?=.*[a-z])(?=.*[0-9])|(?=.*[a-z])(?=.*[^A-Za-z0-9])|(?=.*[0-9])(?=.*[^A-Za-z0-9])).{6,}/,
            "Chinese": /[\u4E00-\u9FA5]/,
            "captcha": /^\d{4,6}$/,
        },
        //url地址
        urlformat: /^((http|https):\/\/)((\w+):?(\w+)?@)?([^\/\?:]+):?(\d+)?(\/?[^\?#]+)?\??([^#]+)?#?(\w*)/,
        date: /^(\d{4})(-|\/|\.)(\d{1,2})\2(\d{1,2})$/, //日期
        ascii: /^[\\x00-\\xFF]+$/, //仅ACSII字符
        zipcode: /^\d{6}$/i, //邮编
        picture: /(.*)\\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)(\s|\?|$)/i, //图片
        qq: /^[1-9][0-9]{4,20}$/,
        "phone": /^1\d{10}$/, //手机
        "telphone": /^[\d-]{3,20}$/ //电话,这个正则回头修正
    }
});
